from flask import Flask, request
import requests

app = Flask(__name__)
TOKEN = "bot89153:02dc7632-bc92-4705-a8b0-4ce3d225b253"
API_URL = f"https://api.eitaa.com/bot{TOKEN}"

@app.route("/", methods=["GET"])
def index():
    return "Eitaa bot is running."

@app.route("/webhook", methods=["POST"])
def webhook():
    data = request.get_json()
    message = data.get("message", {})
    text = message.get("text", "").strip()
    chat_id = message.get("chat", {}).get("id")

    if not chat_id:
        return {"ok": False}

    if text == "/start":
        response = """سلام! خوش آمدید به آتلیه ایرانیان 🎉
لطفاً برای شروع:
عدد 1: رزرو نوبت 📅 
عدد 2: مشاهده قیمت‌ها 💵
عدد 3: مشاهده تم‌ها 🎀
عدد 4: آدرس 📍
عدد 5: ساعات کار ⏳
عدد 6: ارتباط با پشتیبانی 👩‍💻

را ارسال کنید."""
    
    elif text == "1":
        response = """📝نوبت های آتلیه ایرانیان در شیفت صبح از ۱۰:۰۰صبح آغاز و تا ساعت ۱۳:۰۰ ادامه دارد. 
شیفت بعداز ظهر از ساعت ۱۶:۳۰ آغاز و آخرین نوبت ساعت ۲۰:۰۰ است. 
لطفا به ترتیب ساعت و تاریخ مد نظر را وارد کنید.
منتظر باشید تا کارشناس آتلیه جهت تایید نوبت با شما تماس بگیرد.☺️"""

    elif text == "2":
        response = """🏜برای دریافت لیست قیمت چاپ فایل عکس عدد ۷ را ارسال کنید.
📸برای دریافت لیست قیمت عکس آتلیه عدد 8 را ارسال کنید."""

    elif text == "3":
        response = """برای مشاهده انواع تم و دکور های موجود روی لینک زیر کلیک کنید👇
https://photoiraniyan.ir/نمونه-کار-آتلیه-کودک/"""

    elif text == "4":
        response = """🚗شعبه یک: شاهین شهر، خیابان طالقانی،کوی مهدیه(سایت)، بلوار ولایت، جنب دبیرستان رحمت
🚗شعبه دو: شاهین شهر، چهار راه عطار، خیابان شهید شریفی، بن بست ۹ جنوبی، پلاک ۸۰"""

    elif text == "5":
        response = """ساعات کار آتلیه ایرانیان:
09:00 الی 13:30
17:00 الی 22:00"""

    elif text == "6":
        response = """لطفا چند لحظه صبر کنید...
درخواست شما برای پشتیبان ارسال شده به زودی مکالمه آغاز می شود."""

    elif text == "7":
        response = """♡چاپ عکس ۱۰*۱۵  مبلغ ۱۶ هزارتومان♡
♡چاپ عکس ۱۳*۱۸  مبلغ ۴۰ هزارتومان♡
♡چاپ عکس ۱۶*۲۱ مبلغ ۶۵ هزارتومان♡
♡چاپ عکس ۲۰*۲۵  مبلغ ۱۱۵ هزارتومان♡
♡چاپ عکس ۳۰*۲۰  مبلغ ۱۶۵ هزارتومان♡
♡چاپ عکس ۳۰*۲۴  مبلغ ۱۸۵ هزارتومان♡
♡چاپ عکس ۳۰*۴۰ مبلغ ۲۶۵ هزارتومان♡
♡چاپ عکس ۳۰*۶۰  مبلغ ۳۷۵ هزارتومان♡
♡چاپ عکس ۴۰*۶۰  مبلغ ۴۹۵ هزارتومان♡
♡چاپ عکس ۵۰*۷۰ مبلغ ۵۱۰ هزارتومان♡
♡چاپ عکس ۶۰*۹۰  مبلغ ۸۰۰ هزارتومان♡
♡چاپ عکس ۷۰*۱۰۰  مبلغ ۹۵۰ هزارتومان♡

هزینه قاب و شاسی جداگانه محاسبه میشود.
چاپ با کاغذ سیلک و متالیکا ۲۰٪ گرانتر است."""

    elif text == "8":
        response = """♡عکس آتلیه ۱۵*۱۰ مبلغ۲۵۰هزارتومان♡
♡عکس آتلیه ۱۸*۱۳ مبلغ ۳۰۰ هزار تومان♡
♡عکس آتلیه ۲۱*۱۶ مبلغ ۳۸۰ هزارتومان♡
♡عکس آتلیه ۲۵*۲۰ مبلغ ۴۸۰‌هزارتومان♡
♡عکس آتلیه ۳۰*۲۰ مبلغ ۴۹۵ هزارتومان♡
♡عکس آتلیه ۴۰*۳۰ مبلغ ۶۸۰ هزار تومان♡
♡عکس آتلیه ۶۰*۳۰ مبلغ ۸۵۰ هزار تومان♡
♡عکس آتلیه ۶۰*۴۰ مبلغ ۹۵۰ هزار تومان♡
♡عکس آتلیه ۷۰*۵۰ مبلغ ۱،۳۰۰ هزارتومان♡
♡عکس آتلیه ۹۰*۶۰ مبلغ ۱،۵۰۰ هزارتومان♡
♡عکس آتلیه ۱۰۰*مبلغ ۱،۸۰۰ هزار تومان♡

هزینه قاب و شاسی جداگانه محاسبه می شود."""

    else:
        response = "دستور نامعتبر است. لطفاً یکی از عددهای مشخص‌شده را ارسال کنید."

    requests.get(f"{API_URL}/sendMessage", params={"chat_id": chat_id, "text": response})
    return {"ok": True}
